tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'getantibody/tap'

brew 'antibody'
brew 'autojump'
brew 'bat'
brew 'composer'
brew 'dnsmasq'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'mackup'
brew 'mas'
brew 'nginx'
brew 'php'
brew 'php@7.2'
brew 'php@7.3'
brew 'pyenv'
brew 'speedtest-cli'
brew 'trash'
brew 'tree'
brew 'wget'

cask '1password'
cask 'aerial'
cask 'bartender'
cask 'bitwarden'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'memory'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'opera'
cask 'postman'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'

cask 'font-cascadia'
cask 'font-exo2'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-merriweather'
cask 'font-muli'
cask 'font-museo'
cask 'font-merriweather-sans'
cask 'font-noto-sans'
cask 'font-nunito'
cask 'font-open-sans'
cask 'font-oxygen'
cask 'font-pacifico'
cask 'font-playfair-display'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-rubik'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-spectral'
cask 'font-titillium'

mas 'Magnet', id: 441258766
mas 'Spark', id: 1176895641
mas 'Trello', id: 1278508951
