tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'getantibody/tap'

brew 'antibody'         # Zsh package manager
brew 'autojump'         # Allows quickly jumping to folders
brew 'awscli'           # CLI for using AWS
brew 'bat'              # Cat command with syntax highlighting
brew 'composer'         # Package manager for PHP
brew 'coreutils'        # The version provided with macOS is outdated
brew 'dnsmasq'          # DNS caching used for Laravel Valet
brew 'gh'               # CLI for using Github
brew 'git'              # The version provided with XCode is outdated
brew 'htop'             # An interactive process viewer
brew 'httpie'           # Cleaner version of cURL
brew 'imagemagick'      # Converts images to different types
brew 'mackup'           # Keeps your application settings in sync
brew 'mas'              # Mac App Store manager using Brew
brew 'nginx'            # A local web server
brew 'php'              # The latest version of PHP
brew 'php@7.2'          # 7.2 version of PHP
brew 'php@7.3'          # 7.3 version of PHP
brew 'pyenv'            # Python version manager
brew 'redis'            # Database, primarily used for caching
brew 'speedtest-cli'    # Runs internet speed test in terminal
brew 'svn'              # Apache Subversion, required for some font casks
brew 'trash'            # Manages the trash bin
brew 'tree'             # Visualizes a folder hierarchy
brew 'wget'             # Allows retrieving content from HTTP

cask '1password'
cask 'aerial'
cask 'bartender'
cask 'bitwarden'
cask 'dbngin'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'google-chrome'
cask 'iterm2'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'notion'
cask 'postman'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'

cask 'font-cascadia-mono'
cask 'font-exo-2'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-merriweather'
cask 'font-mulish'
cask 'font-museo'
cask 'font-merriweather-sans'
cask 'font-noto-sans'
cask 'font-nunito'
cask 'font-open-sans'
cask 'font-oxygen'
cask 'font-pacifico'
cask 'font-playfair-display'
cask 'font-poppins'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-rubik'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-spectral'
cask 'font-titillium'

mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 441258766
mas 'Spark', id: 1176895641
mas 'Todoist', id: 585829637
mas 'Trello', id: 1278508951
mas 'Xcode', id: 497799835
